In [1]:
# Pandas is the most popular library which is used to data structure and data maniplation , data cleaning and analysis fast

In [2]:
import numpy as np
import pandas as pd

# Introduction to pandas data structure

In [3]:
# Two main datastructure 
# 1. series :- It is the 1-d array-like object which contain sequence of the value and add label which is called index
# 2. Data frame:- A dataframe is the rectangular representation of table contain an ordered , named and collection of columns.

# Series

In [4]:
obj = pd.Series([7, -3, 4, 5])

In [5]:
obj

0    7
1   -3
2    4
3    5
dtype: int64

In [6]:
obj.array

<NumpyExtensionArray>
[np.int64(7), np.int64(-3), np.int64(4), np.int64(5)]
Length: 4, dtype: int64

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = pd.Series([34, 54, 64, 74], index=["@", "#", "$", "a"])

In [9]:
obj2

@    34
#    54
$    64
a    74
dtype: int64

In [10]:
obj2.index

Index(['@', '#', '$', 'a'], dtype='object')

In [11]:
obj2["@"] = 67

In [12]:
obj2

@    67
#    54
$    64
a    74
dtype: int64

In [13]:
obj2[obj2 > 0] #boolean function

@    67
#    54
$    64
a    74
dtype: int64

In [14]:
np.exp(obj2)

@    1.252363e+29
#    2.830753e+23
$    6.235149e+27
a    1.373383e+32
dtype: float64

In [15]:
obj2 * 2

@    134
#    108
$    128
a    148
dtype: int64

In [16]:
"@" in obj2

True

In [17]:
67 not in obj2   #We can not direct access value , It's act as and dictionary

True

In [18]:
obj3 = {"first": "one", "second":"Two", "Third":"threee", "fourth":"four"}

In [19]:
obj3 = pd.Series(obj3)

In [20]:
obj3

first        one
second       Two
Third     threee
fourth      four
dtype: object

In [21]:
#Series can be converted into dictionary 
obj3.to_dict()

{'first': 'one', 'second': 'Two', 'Third': 'threee', 'fourth': 'four'}

In [22]:
obj4 = pd.Series(obj3, index=['second', 'Third', 'fourth', 'five'])

In [23]:
#isna fuction is used to dectect the na value in the data
pd.isna(obj4)

second    False
Third     False
fourth    False
five       True
dtype: bool

In [24]:
pd.notna(obj4)

second     True
Third      True
fourth     True
five      False
dtype: bool

In [25]:
obj3

first        one
second       Two
Third     threee
fourth      four
dtype: object

In [26]:
obj3 + obj4  # It is work as an join method

Third     threeethreee
first              NaN
five               NaN
fourth        fourfour
second          TwoTwo
dtype: object

In [27]:
obj4.name = "home"
obj4.index.name = 'index'

In [28]:
obj4

index
second       Two
Third     threee
fourth      four
five         NaN
Name: home, dtype: object

# Data Frames

In [29]:
data = {"state": ["Ohio", "meerut", "delhi", "jamnapar", "dehradun", "Nepal"],
"year": [2000, 2001, 2002, 2001, 2002, 2003],
"pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [30]:
dataframe = pd.DataFrame(data)

In [31]:
dataframe

      state  year  pop
0      Ohio  2000  1.5
1    meerut  2001  1.7
2     delhi  2002  3.6
3  jamnapar  2001  2.4
4  dehradun  2002  2.9
5     Nepal  2003  3.2

In [32]:
#for large data head method is used to show the five row
#Tail method is used to show the last five row

In [33]:
dataframe.head(2)

    state  year  pop
0    Ohio  2000  1.5
1  meerut  2001  1.7

In [34]:
pd.DataFrame(dataframe, columns=["year", "state", "pop", "debt"]) # to set the order of data

   year     state  pop  debt
0  2000      Ohio  1.5   NaN
1  2001    meerut  1.7   NaN
2  2002     delhi  3.6   NaN
3  2001  jamnapar  2.4   NaN
4  2002  dehradun  2.9   NaN
5  2003     Nepal  3.2   NaN

In [35]:
#to retreive
dataframe.columns

Index(['state', 'year', 'pop'], dtype='object')

In [36]:
dataframe['pop'].head(2)

0    1.5
1    1.7
Name: pop, dtype: float64

In [37]:
dataframe.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [38]:
#iloc and loc method is used to retreve the row data
dataframe.loc[0]

state    Ohio
year     2000
pop       1.5
Name: 0, dtype: object

In [39]:
dataframe

      state  year  pop
0      Ohio  2000  1.5
1    meerut  2001  1.7
2     delhi  2002  3.6
3  jamnapar  2001  2.4
4  dehradun  2002  2.9
5     Nepal  2003  3.2

In [40]:
dataframe['pop'] = 16.5

In [41]:
dataframe

      state  year   pop
0      Ohio  2000  16.5
1    meerut  2001  16.5
2     delhi  2002  16.5
3  jamnapar  2001  16.5
4  dehradun  2002  16.5
5     Nepal  2003  16.5

In [42]:
dataframe['pop'] = np.arange(6)

In [43]:
dataframe

      state  year  pop
0      Ohio  2000    0
1    meerut  2001    1
2     delhi  2002    2
3  jamnapar  2001    3
4  dehradun  2002    4
5     Nepal  2003    5

In [44]:
dataframe['debt'] = dataframe['state'] == 'Ohio'

In [45]:
dataframe

      state  year  pop   debt
0      Ohio  2000    0   True
1    meerut  2001    1  False
2     delhi  2002    2  False
3  jamnapar  2001    3  False
4  dehradun  2002    4  False
5     Nepal  2003    5  False

In [46]:
dataframe['next'] = np.arange(6)

In [47]:
dataframe

      state  year  pop   debt  next
0      Ohio  2000    0   True     0
1    meerut  2001    1  False     1
2     delhi  2002    2  False     2
3  jamnapar  2001    3  False     3
4  dehradun  2002    4  False     4
5     Nepal  2003    5  False     5

In [48]:
#del keyword is used to delete a column of the dataframe
del dataframe['next']

In [49]:
dataframe

      state  year  pop   debt
0      Ohio  2000    0   True
1    meerut  2001    1  False
2     delhi  2002    2  False
3  jamnapar  2001    3  False
4  dehradun  2002    4  False
5     Nepal  2003    5  False

In [50]:
#WE can also create data frame withe the help of inner and outer dictonary
population = {"uttarpardesh":{2001:1.2, 2002:1.3, 2003:1.4, 2005:1.6, 2006:2.6},"california":{2001:2.2, 2002:3.2, 2004:4.2,2005:5.6}}

In [51]:
df3 = pd.DataFrame(population)

In [52]:
#you can transpose of the dataframe
df3.T

              2001  2002  2003  2005  2006  2004
uttarpardesh   1.2   1.3   1.4   1.6   2.6   NaN
california     2.2   3.2   NaN   5.6   NaN   4.2

In [53]:
df3

      uttarpardesh  california
2001           1.2         2.2
2002           1.3         3.2
2003           1.4         NaN
2005           1.6         5.6
2006           2.6         NaN
2004           NaN         4.2

In [54]:
pdata = {'Uttarpadesh' : df3['uttarpardesh'][:-1], 'California': df3['california'][:3]}

In [55]:
pdata = pd.DataFrame(pdata)

In [56]:
pdata

      Uttarpadesh  California
2001          1.2         2.2
2002          1.3         3.2
2003          1.4         NaN
2005          1.6         NaN
2006          2.6         NaN

In [57]:
pdata.index.name = 'year'
pdata.columns.name = 'state'
pdata

state  Uttarpadesh  California
year
2001           1.2         2.2
2002           1.3         3.2
2003           1.4         NaN
2005           1.6         NaN
2006           2.6         NaN

In [58]:
#if you want to change the dataframe into numpyarray
pdata.to_numpy()

array([[1.2, 2.2],
       [1.3, 3.2],
       [1.4, nan],
       [1.6, nan],
       [2.6, nan]])

# IndexObject

In [59]:
#Index is nothing but it is only the label of the data, it is immutable 
obj = pd.Series([2,3,45,66], index=[0, 0,0,0])

In [60]:
obj

0     2
0     3
0    45
0    66
dtype: int64

In [61]:
index = obj.index #we can also store index in objects

In [62]:
index

Index([0, 0, 0, 0], dtype='int64')

In [63]:
#We can also create a index objects and use after 
labels = pd.Index(np.arange(5))

In [64]:
labels

Index([0, 1, 2, 3, 4], dtype='int64')

In [65]:
obj2 = pd.Series([1.5, -2.5, 0, 3.4,4.5], index=labels)

In [66]:
obj2

0    1.5
1   -2.5
2    0.0
3    3.4
4    4.5
dtype: float64

In [67]:
obj2.index is labels

True

In [68]:
'California' in pdata.columns

True

In [69]:
#THERE ARE MANY INDEX OPERATIONS ARE PRESENT LIKE append(), difference(), union(), intersection()
obj2

0    1.5
1   -2.5
2    0.0
3    3.4
4    4.5
dtype: float64

In [70]:
obj2 = obj2.reindex([1, 2, 3, 4, 5, 6, 7, 8, 9])  #it add new index and already index

In [71]:
obj2

1   -2.5
2    0.0
3    3.4
4    4.5
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: float64

In [72]:
#if you want to fill the index which is not present in data during the reindexing
obj2

1   -2.5
2    0.0
3    3.4
4    4.5
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: float64

In [73]:
obj2 = obj2.reindex(np.arange(6), method="ffill")   #It's not work why i don't know

In [74]:
obj2

0    NaN
1   -2.5
2    0.0
3    3.4
4    4.5
5    NaN
dtype: float64

In [75]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=["a", "c", "d"],columns=["Ohio", "Texas", "California"])

In [76]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

# Dropping Entries from Axis

In [77]:
obj = pd.Series(['hey', 'whats', 'upp'], index = ["a", "b", "c"])

In [78]:
obj

a      hey
b    whats
c      upp
dtype: object

In [79]:
obj.drop('c')

a      hey
b    whats
dtype: object

In [80]:
obj.drop(['a', 'b'])

c    upp
dtype: object

In [81]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [82]:
frame.drop(columns = 'Ohio')

   Texas  California
a      1           2
c      4           5
d      7           8

In [83]:
frame.drop(['Texas','California'], axis=1)

   Ohio
a     0
c     3
d     6

# Indexing, Selection and Filtering

In [84]:
obj = pd.Series(np.arange(45,50), index=np.arange(5))

In [85]:
obj

0    45
1    46
2    47
3    48
4    49
dtype: int64

In [86]:
obj[1]

np.int64(46)

In [87]:
obj[obj>46]

2    47
3    48
4    49
dtype: int64

In [88]:
obj[[1,3,4]]

1    46
3    48
4    49
dtype: int64

In [89]:
obj.loc[3:4] = 555

In [90]:
obj

0     45
1     46
2     47
3    555
4    555
dtype: int64

In [91]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=['first', 'second', 'third', 'fourth'], columns=['fc', 'sc', 'tc', 'fc'])

In [92]:
data

        fc  sc  tc  fc
first    0   1   2   3
second   4   5   6   7
third    8   9  10  11
fourth  12  13  14  15

In [93]:
data["fc"]       #Accessing through the columns

        fc  fc
first    0   3
second   4   7
third    8  11
fourth  12  15

In [94]:
data[0:2]  #Accessing the through the index

        fc  sc  tc  fc
first    0   1   2   3
second   4   5   6   7

In [95]:
data[data["tc"]>3]

        fc  sc  tc  fc
second   4   5   6   7
third    8   9  10  11
fourth  12  13  14  15

In [96]:
data["tc"]< 5

first      True
second    False
third     False
fourth    False
Name: tc, dtype: bool

# selection of dataframe with loc and iloc

In [97]:
data

        fc  sc  tc  fc
first    0   1   2   3
second   4   5   6   7
third    8   9  10  11
fourth  12  13  14  15

In [98]:
data.loc['first']   #Access through the index not a column

fc    0
sc    1
tc    2
fc    3
Name: first, dtype: int64

In [99]:
data['fc']

        fc  fc
first    0   3
second   4   7
third    8  11
fourth  12  15

In [100]:
data.loc[['first','second']]  #double index pass as a list

        fc  sc  tc  fc
first    0   1   2   3
second   4   5   6   7

In [101]:
data.loc['first', ['fc','sc']]

fc    0
fc    3
sc    1
Name: first, dtype: int64

In [102]:
#SELECTION WITH THE INTEGER align with index
data.iloc[3]

fc    12
sc    13
tc    14
fc    15
Name: fourth, dtype: int64

In [103]:
data.iloc[[1,2]]

        fc  sc  tc  fc
second   4   5   6   7
third    8   9  10  11

In [104]:
data.iloc[2, [3,0,1]]

fc    11
fc     8
sc     9
Name: third, dtype: int64

In [105]:
#with the lable of lists
data.loc[:'third', "tc"][data['tc']> 5]

second     6
third     10
Name: tc, dtype: int64

In [106]:
data.loc[data.tc< 8]    #Boolean is used in a loc but not in iloc

        fc  sc  tc  fc
first    0   1   2   3
second   4   5   6   7

In [107]:
# Integer indexing pitfall

In [108]:
sr = pd.Series(np.arange(3.0))

In [109]:
sr

0    0.0
1    1.0
2    2.0
dtype: float64

In [110]:
# sr[-1]  #it is a fallback issue without indexing you do not ir

In [111]:
sr = sr.reindex(['First', 'Second', 'Third'])

In [112]:
sr

First    NaN
Second   NaN
Third    NaN
dtype: float64

In [113]:
data

        fc  sc  tc  fc
first    0   1   2   3
second   4   5   6   7
third    8   9  10  11
fourth  12  13  14  15

In [114]:
data.loc[data.tc == 6, 'tc'] = 77

In [115]:
data

        fc  sc  tc  fc
first    0   1   2   3
second   4   5  77   7
third    8   9  10  11
fourth  12  13  14  15

In [116]:
data.loc['second'] = 5

In [117]:
data

        fc  sc  tc  fc
first    0   1   2   3
second   5   5   5   5
third    8   9  10  11
fourth  12  13  14  15

# arithmetic with non fill and fill

In [118]:
data1 = pd.DataFrame(np.arange(9).reshape((3,3)), columns=list("abc"), index=['first', 'second', 'third'])

In [119]:
data12 = pd.DataFrame(np.arange(9).reshape((3,3)), columns=list("bdc"), index=['first', 'fourth', 'third'])

In [120]:
data1 + data12

         a     b     c   d
first  NaN   1.0   4.0 NaN
fourth NaN   NaN   NaN NaN
second NaN   NaN   NaN NaN
third  NaN  13.0  16.0 NaN

In [121]:
# if we add a data which has no lables in columns and row so it Give always one

In [122]:
#FOR FILLING THE VALUE IN THE NULL PALCE

In [123]:
df1 = pd.DataFrame(np.arange(12).reshape((3,4)), columns=list('abcd'))

In [124]:
df2 = pd.DataFrame(np.arange(12).reshape((4,3)), columns=list('abc'))

In [127]:
df2.loc[1, "b"] = np.nan

In [128]:
df1+df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   NaN  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [129]:
#add for fill
df1.add(df2, fill_value = 0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   5.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3   9.0  10.0  11.0   NaN

In [130]:
df2.add(df1, fill_value = 0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   5.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3   9.0  10.0  11.0   NaN

In [132]:
1/df1 == df1.rdiv(1)   #Both are equals

      a     b     c     d
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True

In [133]:
df2.reindex(columns=df1.columns, fill_value=0)

   a     b   c  d
0  0   1.0   2  0
1  3   NaN   5  0
2  6   7.0   8  0
3  9  10.0  11  0

# calculation between series and dataframe

In [134]:
arr = np.arange(9).reshape((3,3))

In [135]:
arr[0]

array([0, 1, 2])

In [136]:
arr - arr[0]

array([[0, 0, 0],
       [3, 3, 3],
       [6, 6, 6]])

In [137]:
df3

      uttarpardesh  california
2001           1.2         2.2
2002           1.3         3.2
2003           1.4         NaN
2005           1.6         5.6
2006           2.6         NaN
2004           NaN         4.2

In [138]:
series = df3.iloc[1]

In [139]:
series

uttarpardesh    1.3
california      3.2
Name: 2002, dtype: float64

In [141]:
df3 - series   #By default in calculation the series index is match through the dataframe columns

      uttarpardesh  california
2001          -0.1        -1.0
2002           0.0         0.0
2003           0.1         NaN
2005           0.3         2.4
2006           1.3         NaN
2004           NaN         1.0

# Mapping

In [144]:
data = pd.DataFrame(np.random.standard_normal((4,3)), index=['first', 'second', 'third', 'fourth'], columns=list('abc'))

In [145]:
data

               a         b         c
first  -0.492067 -1.084792  1.288401
second  1.753102 -0.983989 -1.284592
third  -1.276120 -0.878183  0.905665
fourth -0.222673 -0.204614 -0.421309

In [146]:
np.abs(data)

               a         b         c
first   0.492067  1.084792  1.288401
second  1.753102  0.983989  1.284592
third   1.276120  0.878183  0.905665
fourth  0.222673  0.204614  0.421309

In [150]:
def f1(x):
    return x.max() - x.min()

In [151]:
data.apply(f1)

a    3.029223
b    0.880178
c    2.572993
dtype: float64

In [153]:
data.apply(f1, axis='columns')

first     2.373193
second    3.037694
third     2.181786
fourth    0.216695
dtype: float64

In [154]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [155]:
data.apply(f2)

            a         b         c
min -1.276120 -1.084792 -1.284592
max  1.753102 -0.204614  1.288401

In [156]:
series

uttarpardesh    1.3
california      3.2
Name: 2002, dtype: float64

In [157]:
series.sort_index()

california      3.2
uttarpardesh    1.3
Name: 2002, dtype: float64

In [159]:
data

               a         b         c
first  -0.492067 -1.084792  1.288401
second  1.753102 -0.983989 -1.284592
third  -1.276120 -0.878183  0.905665
fourth -0.222673 -0.204614 -0.421309

In [166]:
data.sort_index(axis='columns', ascending=False)

               c         b         a
first   1.288401 -1.084792 -0.492067
second -1.284592 -0.983989  1.753102
third   0.905665 -0.878183 -1.276120
fourth -0.421309 -0.204614 -0.222673

In [167]:
s1 = pd.Series([4, np.nan, 3, np.nan, 34])

In [169]:
s1.sort_values()

2     3.0
0     4.0
4    34.0
1     NaN
3     NaN
dtype: float64

In [170]:
s1.sort_values(na_position = "first")

1     NaN
3     NaN
2     3.0
0     4.0
4    34.0
dtype: float64

In [171]:
data.sort_values("a")

               a         b         c
third  -1.276120 -0.878183  0.905665
first  -0.492067 -1.084792  1.288401
fourth -0.222673 -0.204614 -0.421309
second  1.753102 -0.983989 -1.284592

In [174]:
#Ranking system
s1 = pd.Series([3, 3, 4, 6, 33, 78, 90])

In [175]:
s1.rank()

0    1.5
1    1.5
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
dtype: float64

In [179]:
s1.rank(method='first')

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
dtype: float64

In [180]:
obj = pd.Series([4,6,3], index=['a', 'b', 'a'])

In [182]:
obj.index.is_unique

False

# Unique value and membership

In [183]:
obj = pd.Series(['a', 'b', 'a', 'b', 'c', 'c', 'c', 'd', 'e'])

In [185]:
obj.unique()

array(['a', 'b', 'c', 'd', 'e'], dtype=object)

In [186]:
obj.value_counts()

c    3
a    2
b    2
d    1
e    1
Name: count, dtype: int64

In [190]:
#this function take an array in form of series
pd.Series(obj).value_counts()

c    3
a    2
b    2
d    1
e    1
Name: count, dtype: int64

In [191]:
obj.isin(["b", "c"])

0    False
1     True
2    False
3     True
4     True
5     True
6     True
7    False
8    False
dtype: bool